       IDENTIFICATION DIVISION.
       PROGRAM-ID.     IMPERIALDATE
       AUTHOR.         deps

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 WS-CURRENT-DATE-DATA.
         05  WS-CURRENT-DATE.
             10  WS-CURRENT-YEAR         PIC 9(04).
             10  WS-CURRENT-MONTH        PIC 9(02).
             10  WS-CURRENT-DAY          PIC 9(02).
         05  WS-CURRENT-TIME.
             10  WS-CURRENT-HOURS        PIC 9(02).
             10  WS-CURRENT-MINUTE       PIC 9(02).
             10  WS-CURRENT-SECOND       PIC 9(02).
             10  WS-CURRENT-MILLISECONDS PIC 9(02).
             10  WS-CURRENT-TIMEZONE     PIC S9(4).

       01 JULIAN.
           05 MILLENIUM PIC 9.
           05 FILLER PIC 9.
           05 JYEAR PIC 99.
           05 JDAY PIC 9(3).

       01 TEMP9 Pic 9(9).
       01 TEMP7 PIC 9(7).

       01 MAKR-CONST PIC 9V9(8) VALUE 0.11407955.

       01 IMPERIAL-FORMAT.
           05 IF-YEARFRACTION PIC 9(3).
           05 FILLER PIC X VALUE '.'.
           05 IF-YEAR PIC 9(3).
           05 FILLER PIC XX VALUE '.M'.
           05 IF-MILLENIUM PIC 99.


       PROCEDURE DIVISION.

      *    GET THE JULIAN CALENDAR
           MOVE FUNCTION CURRENT-DATE(1:8) to TEMP9.
           COMPUTE TEMP9 = FUNCTION INTEGER-OF-DATE(TEMP9)           
           COMPUTE TEMP7 = FUNCTION DAY-OF-INTEGER(TEMP9)
           MOVE TEMP7 TO JULIAN.

      *    GET THE GREGORIAN CALENDAR
           MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-DATA.
      *    Alternative:
      *    ACCEPT WS-CURRENT-DATE FROM DATE YYYYMMDD

      *    ADD 1 TO GET THE CORRECT MILLENIUM DIGIT. 
      *    ADD 10 TO TURN IT INTO THE HOLOCENE CALENDAR.
           ADD 11 TO MILLENIUM GIVING IF-MILLENIUM.
           MOVE JYEAR TO IF-YEAR.
      *    CALCULATE YEAR FRACTION 000 TO 999           
           MULTIPLY JDAY BY 24 GIVING TEMP9.
           ADD WS-CURRENT-HOURS TO TEMP9 GIVING TEMP9.
           MULTIPLY TEMP9 BY MAKR-CONST GIVING IF-YEARFRACTION.

           DISPLAY IMPERIAL-FORMAT.

           STOP RUN.
